In [1]:
import pandas as pd
import numpy as np

In [2]:
# Raw data file
file = "Resources/purchase_data.csv"

# Read purchasing file and store into pandas data frame
purchase_data_df = pd.read_csv(file)

In [3]:
#display the head of both the dataframe
display(purchase_data_df.head(5))

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
#to check datatype of each column in dataframe
purchase_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
Purchase ID    780 non-null int64
SN             780 non-null object
Age            780 non-null int64
Gender         780 non-null object
Item ID        780 non-null int64
Item Name      780 non-null object
Price          780 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.7+ KB

In [5]:
# To  find total Number of Players
purchase_data_df['SN'].nunique()

576

In [6]:
pd.DataFrame({"Total Number of Players":purchase_data_df['SN'].nunique()},index=[0])

   Total Number of Players
0                      576

In [7]:
# To get Number of Unique Items in Dataframe
purchase_data_df['Item ID'].nunique()

183

In [8]:
# To find Average Purchase Price
purchase_data_df['Price'].mean()

3.050987179487176

In [9]:
# To get Total Number of Purchases
len(purchase_data_df)

780

In [10]:
# To find Total Revenue
purchase_data_df['Price'].sum()

2379.77

In [11]:
purchase_analysis_df= pd.DataFrame({
"Number of Unique Items":purchase_data_df['Item ID'].nunique(),
"Average Purchase Price":purchase_data_df['Price'].mean(),
"Total Number of Purchases":len(purchase_data_df),
"Total Revenue": purchase_data_df['Price'].sum()},index=[0])

purchase_analysis_df

purchase_analysis_df.style.format({"Average Purchase Price": "${:.2f}", "Total Revenue": "${:.2f}"})

In [12]:
# GENDER DEMOGRAPHICHS

In [13]:
# get all the duplicate rows
display(purchase_data_df.loc[purchase_data_df.duplicated("SN",keep=False),:].sort_values("SN").head(10))
display(len(purchase_data_df.loc[purchase_data_df.duplicated("SN",keep=False),:]))

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
218,218,Aelastirin39,23,Male,76,Haunted Bronzed Bludgeon,3.15
766,766,Aelastirin39,23,Male,58,"Freak's Bite, Favor of Holy Might",4.14
584,584,Aelin32,20,Male,115,Spectral Diamond Doomblade,2.04
87,87,Aelin32,20,Male,151,Severance,3.40
52,52,Aelin32,20,Male,60,Wolf,3.54
43,43,Aelly27,24,Male,116,Renewed Skeletal Katana,4.18
428,428,Aelly27,24,Male,14,Possessed Core,2.61
203,203,Aelollo59,33,Male,3,Phantomlight,2.49
431,431,Aelollo59,33,Male,172,Blade of the Grave,3.14
578,578,Aerithllora36,29,Female,153,Mercenary Sabre,3.74

366

In [14]:
# To remove duplicate data, drop the duplicate SN rows to get gender propotions
purchase_data_df_unique = purchase_data_df.drop_duplicates("SN", keep='first')
len(purchase_data_df_unique)

576

In [15]:
gender_demo_df = pd.DataFrame({
"Percentage of players" : purchase_data_df_unique["Gender"].value_counts(normalize=True),
"Total Count" : purchase_data_df_unique["Gender"].value_counts()
})
gender_demo_df.style.format({"Percentage of Players": "{:.2f} %"})

In [16]:
# PURCHASING ANALYSIS BY GENDER

In [19]:
Total_count = purchase_data_df["SN"].nunique()
Male_count = purchase_data_df[purchase_data_df["Gender"] == "Male"]["SN"].nunique()
Female_count = purchase_data_df[purchase_data_df["Gender"] == "Female"]["SN"].nunique()
Oth_count = Total_count - Male_count - Female_count

Pur_male = purchase_data_df[purchase_data_df["Gender"] == "Male"]["Price"].count()
Pur_fem = purchase_data_df[purchase_data_df["Gender"] == "Female"]["Price"].count()
Pur_oth = Total_count - Pur_male - Pur_fem
price_avg_M = purchase_data_df[purchase_data_df["Gender"] == "Male"]['Price'].mean()
price_avg_F = purchase_data_df[purchase_data_df["Gender"] == "Female"]['Price'].mean()
price_avg_O = purchase_data_df[purchase_data_df["Gender"] == "Other / Non-Disclosed"]['Price'].mean()
Tot_price_M = purchase_data_df[purchase_data_df["Gender"] == "Male"]['Price'].sum()
Tot_price_F = purchase_data_df[purchase_data_df["Gender"] == "Female"]['Price'].sum()
Tot_price_O = purchase_data_df[purchase_data_df["Gender"] == "Other / Non-Disclosed"]['Price'].sum()

mnorm = Tot_price_M/Male_count
fnorm = Tot_price_F/Female_count
onorm = Tot_price_O/Oth_count

gender_purchase_df = pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"], "Purchase Count": [Pur_male, Pur_fem, Pur_oth],
                                        "Average Purchase Price": [price_avg_M, price_avg_F, price_avg_O], "Total Purchase Value": [Tot_price_M, Tot_price_F, Tot_price_O],
                                "Normalized Totals": [mnorm, fnorm, onorm]}, columns = 
                                        ["Gender", "Purchase Count", "Average Purchase Price", "Total Purchase Value", "Normalized Totals"])
                                        
gender_purchase_final = gender_purchase_df.set_index("Gender")
gender_purchase_final.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${:.2f}", "Normalized Totals": "${:.2f}"})

In [20]:
# AGE DEMOGRAPHICS

In [21]:

# Establish bins for ages

bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
age_ranges = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [22]:
# Cut purchase data and place the ages into bins
pd.cut(purchase_data_df["Age"], bins, labels=age_ranges)

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
5      20-24
6      35-39
7      20-24
8      20-24
9      35-39
10     20-24
11     20-24
12     20-24
13     20-24
14     35-39
15     20-24
16     20-24
17     20-24
18     20-24
19     30-34
20     20-24
21     20-24
22     35-39
23       40+
24     30-34
25     25-29
26     10-14
27       <10
28     20-24
29     20-24
       ...
750    20-24
751    10-14
752    15-19
753    35-39
754    20-24
755    10-14
756    20-24
757    15-19
758    20-24
759    25-29
760    20-24
761      40+
762    25-29
763    20-24
764    15-19
765    15-19
766    20-24
767      <10
768    35-39
769    15-19
770    30-34
771    15-19
772    25-29
773    20-24
774    10-14
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [23]:
purchase_data_df["Age Range"] = pd.cut(purchase_data_df["Age"], bins, labels= age_ranges)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [33]:
# Purchase count by age range.

age_group_count_df = purchase_data_df.groupby("Age Range")["Item Name"]
age_group_count_df.count()

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Item Name, dtype: int64

In [34]:
# Average purchase price by age range.
age_group_average_df = purchase_data_df.groupby("Age Range")["Price"].mean()
age_group_average_df.round(2)

Age Range
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [35]:
#Total purchase value by age range.
age_group_total_df = purchase_data_df.groupby("Age Range")["Price"].sum()
age_group_total_df

Age Range
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [36]:
#Normalized totals by age range.

normalized_age_total_df = age_group_total_df/573
normalized_age_total_df.round(2)

Age Range
<10      0.13
10-14    0.14
15-19    0.72
20-24    1.94
25-29    0.51
30-34    0.37
35-39    0.26
40+      0.07
Name: Price, dtype: float64

In [24]:

#Players percentage by age range.

age_group_percentage_df = round(purchase_data_df["Age Range"].value_counts()/780,2)
age_group_percentage_df

20-24    0.47
15-19    0.17
25-29    0.13
30-34    0.09
35-39    0.05
10-14    0.04
<10      0.03
40+      0.02
Name: Age Range, dtype: float64

In [37]:
# Convert to DataFrame.

age_range_df = pd.DataFrame({"Players percentage":age_group_percentage_df,
                            "Total Count":age_group_count_df.count()
                           
})
age_range_df

       Players percentage  Total Count
10-14                0.04           28
15-19                0.17          136
20-24                0.47          365
25-29                0.13          101
30-34                0.09           73
35-39                0.05           41
40+                  0.02           13
<10                  0.03           23

In [49]:
# Convert to DataFrame.

# Purchase Count
# Average Purchase Price
# Total Purchase Value
# Normalized Totals

age_range_df = pd.DataFrame({
"Purchase Count" :age_group_average_df.round(2),
"Average Purchase Price" :age_group_average_df,
"Total Purchase Value": age_group_total_df,
"Normalized Totals": normalized_age_total_df.round(2)})

age_range_df

,Average Purchase Price,Normalized Totals,Purchase Count,Total Purchase Value
Age Range,,,,
<10,3.353478,0.13,3.35,77.13
10-14,2.956429,0.14,2.96,82.78
15-19,3.035956,0.72,3.04,412.89
20-24,3.052219,1.94,3.05,1114.06
25-29,2.900990,0.51,2.90,293.00
30-34,2.931507,0.37,2.93,214.00
35-39,3.601707,0.26,3.60,147.67
40+,2.941538,0.07,2.94,38.24

In [51]:
#Overall spending analysis

pl_pur_count_df = purchase_data_df.groupby("SN").count()["Price"].rename("Purchase Count")
pl_avg_price_df = purchase_data_df.groupby("SN").mean()["Price"].rename("Average Purchase Price")
plys_tot_df = purchase_data_df.groupby("SN").sum()["Price"].rename("Total Purchase Value")

#Convert to DataFrame.

tot_data_df = pd.DataFrame({"Purchase Count":pl_pur_count_df,
                                   "Average Purchase Price": pl_avg_price_df,
                                   "Total Purchase Value": plys_tot_df})
tot_data_df.head()

              Average Purchase Price  Purchase Count  Total Purchase Value
SN
Adairialis76                    2.28               1                  2.28
Adastirin33                     4.48               1                  4.48
Aeda94                          4.91               1                  4.91
Aela59                          4.32               1                  4.32
Aelaria33                       1.79               1                  1.79

In [52]:
# Sort table to show the top five spenders.

top_five_spenders = tot_data_df.sort_values("Total Purchase Value", ascending=False)
top_five_spenders.head()

             Average Purchase Price  Purchase Count  Total Purchase Value
SN
Lisosia93                  3.792000               5                 18.96
Idastidru52                3.862500               4                 15.45
Chamjask73                 4.610000               3                 13.83
Iral74                     3.405000               4                 13.62
Iskadarya95                4.366667               3                 13.10

In [53]:
# Total items purchases analysis.

item_pur_count_df = purchase_data_df.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
item_avg_price_df = purchase_data_df.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price")
items_value_total_df = purchase_data_df.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")

# Convert to new DataFrame

items_purchased_df = pd.DataFrame({"Purchase Count":item_pur_count_df,
                                   "Item Price":item_avg_price_df,
                                   "Total Purchase Value":items_value_total_df,})

items_purchased_df.head()

                            Item Price  Purchase Count  Total Purchase Value
Item ID Item Name
0       Splinter                  1.28               4                  5.12
1       Crucifer                  3.26               3                  9.78
2       Verdict                   2.48               6                 14.88
3       Phantomlight              2.49               6                 14.94
4       Bloodlord's Fetish        1.70               5                  8.50

In [67]:
# Sort table to show the five the most popular items.

most_popular_items_df = items_purchased_df.sort_values("Purchase Count", ascending=False)

most_popular_items_df.head()

,,Item Price,Purchase Count,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
145,Fiery Glass Crusader,4.58,9,41.22
108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
82,Nirvana,4.90,9,44.10
19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16

In [56]:
# Sort table to show the five the most profitable items.

most_profitable_items_df = items_purchased_df.sort_values("Total Purchase Value", ascending=False)
most_profitable_items_df.head()

,,Item Price,Purchase Count,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
82,Nirvana,4.90,9,44.10
145,Fiery Glass Crusader,4.58,9,41.22
92,Final Critic,4.88,8,39.04
103,Singed Scalpel,4.35,8,34.80